In [2]:
%load_ext sql

In [3]:
%%sql
sqlite:///CourseData.db

'Connected: @CourseData.db'

In [41]:
%%sql
SELECT DISTINCT primary_instructor
FROM INSTRUCTOR 
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[('Michael P.  Coyne',),
 ('Rebecca I.  Bloch',),
 ('Paul   Caster',),
 ('Jo Ann   Drusbosky',),
 ('Arleen N.  Kardos',),
 ('Scott M  Brenner',),
 ('Kevin C.  Cassidy',),
 ('Bruce   Bradford',),
 ('Milo W.  Peck',),
 ('Stephen E.  Yost',)]

In [42]:
%%sql
SELECT DISTINCT location, CRN
FROM COURSE_MEETING
LIMIT 5;

 * sqlite:///CourseData.db
Done.

[('DSB 105', '70384'),
 ('DSB 105', '70385'),
 ('DSB 105', '70382'),
 ('DSB 111', '70291'),
 ('DSB 111', '70350')]

In [43]:
%%sql
SELECT DISTINCT (primary_instructor) AS Teacher, COUNT(section) AS No_sections
FROM COURSE_OFFERING 
WHERE act >10
GROUP BY primary_instructor
ORDER BY No_sections DESC
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[('Nicole Elizabeth  Heller', 156),
 ('Kamala   Kiem', 93),
 ('Nancy A.  Moriber', 67),
 ('Anthony J.  DeCristofaro', 56),
 ('Christine   Earls', 48),
 ('Bidyut B.  Das', 46),
 ('Sharlene A.  McEvoy', 45),
 ('Milo W.  Peck', 43),
 ('Rose P.  Rodrigues', 43),
 ('John E.  Neal', 41)]

In [46]:
%%sql
SELECT DISTINCT (primary_instructor) AS Teacher, COUNT(section) AS Section
FROM COURSE_OFFERING 
WHERE term = 'Fall2018' AND act > 10
GROUP BY primary_instructor, section
ORDER BY section DESC
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[('Sonya R.  Huber', 5),
 ('Nancy A.  Moriber', 4),
 ('Amalia I.  Rusu', 3),
 ('Dorothea D.  Braginsky', 3),
 ('James E.  Biardi', 3),
 ('Jeffrey I.  Kramer', 3),
 ('Lucrecia   Garcia Iommi', 3),
 ('Mary Sallyanne   Ryan', 3),
 ('Michael P.  Pagano', 3),
 ('Michael Walden  Creane', 3)]

In [4]:
%%sql
SELECT title, location
FROM COURSE_OFFERING, COURSE_MEETING
JOIN COURSE_MEETING ON (COURSE_MEETING.CRN = COURSE_OFFERING.CRN)
WHERE term = 'Fall2014';

 * sqlite:///CourseData.db
(sqlite3.OperationalError) ambiguous column name: location [SQL: "SELECT title, location\nFROM COURSE_OFFERING, COURSE_MEETING\nJOIN COURSE_MEETING ON (COURSE_MEETING.CRN = COURSE_OFFERING.CRN)\nWHERE term = 'Fall2014';"] (Background on this error at: http://sqlalche.me/e/e3q8)

In [51]:
%%sql
SELECT *
FROM COURSE_MEETING
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(1, '70384', 'Fall2014', 'DSB 105', 'T', '2014-09-02T08:00:00', '2014-09-02T09:15:00'),
 (2, '70384', 'Fall2014', 'DSB 105', 'F', '2014-09-05T08:00:00', '2014-09-05T09:15:00'),
 (3, '70384', 'Fall2014', 'DSB 105', 'T', '2014-09-09T08:00:00', '2014-09-09T09:15:00'),
 (4, '70384', 'Fall2014', 'DSB 105', 'F', '2014-09-12T08:00:00', '2014-09-12T09:15:00'),
 (5, '70384', 'Fall2014', 'DSB 105', 'T', '2014-09-16T08:00:00', '2014-09-16T09:15:00'),
 (6, '70384', 'Fall2014', 'DSB 105', 'F', '2014-09-19T08:00:00', '2014-09-19T09:15:00'),
 (7, '70384', 'Fall2014', 'DSB 105', 'T', '2014-09-23T08:00:00', '2014-09-23T09:15:00'),
 (8, '70384', 'Fall2014', 'DSB 105', 'F', '2014-09-26T08:00:00', '2014-09-26T09:15:00'),
 (9, '70384', 'Fall2014', 'DSB 105', 'T', '2014-09-30T08:00:00', '2014-09-30T09:15:00'),
 (10, '70384', 'Fall2014', 'DSB 105', 'F', '2014-10-03T08:00:00', '2014-10-03T09:15:00')]

In [52]:
%%sql
SELECT *
FROM COURSE_OFFERING
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(1, '70384', 'AC 0011', 'Fall2014', 'C01', 'Introduction to Financial Accounting', '3.000', 0, 31, -31, "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Michael P.  Coyne'),
 (2, '70385', 'AC 0011', 'Fall2014', 'C02', 'Introduction to Financial Accounting', '3.000', 0, 31, -31, "[{'days': 'TF', 'times': '0930am-1045am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0930am-1045am 09/02-12/08 DSB 105']", 'Michael P.  Coyne'),
 (3, '70382', 'AC 0011', 'Fall2014', 'C03', 'Introduction to Financial Accounting', '3.000', 0, 31, -31, "[{'days': 'TF', 'times': '1230pm-0145pm', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 1230pm-0145pm 09/02-12/08 DSB 105']", 'Michael P.  Coyne'),
 (4, '70291', 'AC 0011', 'Fall2014', 'C04', 'Introduction to Financial Accounting', '3.000', 0, 29, -29, "[{'days': 'MR', 'times': '1100am-1215pm', 'dates': '09/02-12/08', 'location': 'DSB 111'}]", "['MR 1100am-1215pm 09/02-12/08 DSB 111']", 'Rebecca I.  Bloch'),
 (5, '70350', 'AC 0011', 'Fall2014', 'C05', 'Introduction to Financial Accounting', '3.000', 0, 30, -30, "[{'days': 'MR', 'times': '1230pm-0145pm', 'dates': '09/02-12/08', 'location': 'DSB 111'}]", "['MR 1230pm-0145pm 09/02-12/08 DSB 111']", 'Rebecca I.  Bloch'),
 (6, '70381', 'AC 0011', 'Fall2014', 'C06', 'Introduction to Financial Accounting', '3.000', 0, 31, -31, "[{'days': 'MR', 'times': '0330pm-0445pm', 'dates': '09/02-12/08', 'location': 'DSB 110A'}]", "['MR 0330pm-0445pm 09/02-12/08 DSB 110A']", 'Rebecca I.  Bloch'),
 (7, '70383', 'AC 0011', 'Fall2014', 'G', 'Introduction to Financial Accounting', '3.000', 30, 31, -1, "[{'days': 'MR', 'times': '0930am-1045am', 'dates': '09/02-12/08', 'location': 'DSB 111'}]", "['MR 0930am-1045am 09/02-12/08 DSB 111']", 'Paul   Caster'),
 (8, '70391', 'AC 0011', 'Fall2014', 'H', 'Introduction to Financial Accounting', '3.000', 30, 32, -2, "[{'days': 'TF', 'times': '0930am-1045am', 'dates': '09/02-12/08', 'location': 'DSB 110A'}]", "['TF 0930am-1045am 09/02-12/08 DSB 110A']", 'Jo Ann   Drusbosky'),
 (9, '71105', 'AC 0011', 'Fall2014', 'I', 'Introduction to Financial Accounting', '3.000', 30, 33, -3, "[{'days': 'TF', 'times': '1100am-1215pm', 'dates': '09/02-12/08', 'location': 'DSB 110A'}]", "['TF 1100am-1215pm 09/02-12/08 DSB 110A']", 'Jo Ann   Drusbosky'),
 (10, '71123', 'AC 0011', 'Fall2014', 'J', 'Introduction to Financial Accounting', '3.000', 30, 32, -2, "[{'days': 'TF', 'times': '0200pm-0315pm', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0200pm-0315pm 09/02-12/08 DSB 105']", 'Jo Ann   Drusbosky')]